{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "batch_input_shape": [null, 32, 32, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "filters": 32, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "valid", "filters": 32, "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "filters": 64, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4", "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "valid", "filters": 64, "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 512, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 10, "use_bias": true, "bias_regularizer": null}}]}